interface Cocktail {
  name: string
  description: string
}

export function getCocktail(): Cocktail {
  const cocktailIndex = Math.floor(Math.random() * cocktails.length)

  return cocktails[cocktailIndex]
}

const cocktails: Cocktail[] = [
  {
    description: '甘くフルーティーかつアルコール度数も控えめで、お酒が弱い人にもおすすめです。カシスリキュールとオレンジジュースで作ることができます。',
    name: 'カシスオレンジ',
  },
  {
    description: 'フルーティーですが甘さが控えめで、さっぱりと飲めます。カシスリキュールとグレープフルーツジュースで作ることができます。',
    name: 'カシスグレープフルーツ',
  },
  {
    description: 'とてもフルーティーで度数も低いことから女性に人気です。ピーチリキュールとオレンジジュースで作ることができます。',
    name: 'ファジーネーブル',
  },
  {
    description: '喉にべたべたせず、さっぱりした感じです。ピーチリキュールとソーダで作ることができます。',
    name: 'ピーチソーダ',
  },
  {
    description: 'さっぱりとした飲み口で、さわやかな香りがあります。ウォッカとジンジャーエール、ライムジュースで作ることができます。',
    name: 'モスコミュール',
  },
  {
    description: '口当たりがよく女性に人気があり、ウォッカでアルコールの強さも調整しやすいお酒です。ウォッカとオレンジジュースで作ることができます。',
    name: 'スクリュードライバー',
  },
  {
    description: 'とても爽やかな味わいで、すこしツンとした癖のある香りがします。ドライ・ジンとトニックウォーター、ライムカットで作ることができます。',
    name: 'ジントニック',
  },
  {
    description: 'さわやかな味わいで癖のある香りがしますが、甘いので飲みやすいです。ドライ・ジンとジンジャーエール、レモンジュースで作ることができます。',
    name: 'ジンバック',
  },
  {
    description: '爽やかな香りと、フルーティーなおいしさがマッチしたお酒です。ジンとオレンジジュースで作ることができます。',
    name: 'オレンジブロッサム',
  },
  {
    description: 'オレンジの香りを持ち、少し強めでシャープな味わいです。ドライ・ジンとホワイト・キュラソー、レモンジュースで作ることができます。',
    name: 'ホワイト・レディー',
  },
  {
    description: 'コーヒー牛乳のような、甘くまろやかな味がします。カルーアと牛乳で作ることができます。',
    name: 'カルーアミルク',
  },
  {
    description: 'グラスの淵についている食塩のしょっぱさと苦みがよくマッチしたお酒です。ウォッカとグレープフルーツジュース、食塩で作ることができます。',
    name: 'ソルティドッグ',
  },
  {
    description: 'フルーティーなのにおしゃれな味で、「この世で最もおいしくて贅沢なオレンジジュース」といわれています。シャンパンとオレンジジュースで作ることができます。',
    name: 'ミモザ',
  },
]
